# Importing Data

In [1]:
# Question 1 : 데이터를 로드하라. 데이터는 \t를 기준으로 구분되어 있다.
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/lol.csv', sep = '\t')
df.head(2)

,gameId,creationTime,gameDuration,seasonId,winner,firstBlood,firstTower,firstInhibitor,firstBaron,firstDragon,...,t2_towerKills,t2_inhibitorKills,t2_baronKills,t2_dragonKills,t2_riftHeraldKills,t2_ban1,t2_ban2,t2_ban3,t2_ban4,t2_ban5
0,3326086514,1504279457970,1949,9,1,2,1,1,1,1,...,5,0,0,1,1,114,67,43,16,51
1,3229566029,1497848803862,1851,9,1,1,1,1,0,1,...,2,0,0,0,0,11,67,238,51,420

In [2]:
 # Question 2 : 데이터의 상위 5개 행을 출력하라.
import pandas as pd
df.head()

,gameId,creationTime,gameDuration,seasonId,winner,firstBlood,firstTower,firstInhibitor,firstBaron,firstDragon,...,t2_towerKills,t2_inhibitorKills,t2_baronKills,t2_dragonKills,t2_riftHeraldKills,t2_ban1,t2_ban2,t2_ban3,t2_ban4,t2_ban5
0,3326086514,1504279457970,1949,9,1,2,1,1,1,1,...,5,0,0,1,1,114,67,43,16,51
1,3229566029,1497848803862,1851,9,1,1,1,1,0,1,...,2,0,0,0,0,11,67,238,51,420
2,3327363504,1504360103310,1493,9,1,2,1,1,1,2,...,2,0,0,1,0,157,238,121,57,28
3,3326856598,1504348503996,1758,9,1,1,1,1,1,1,...,0,0,0,0,0,164,18,141,40,51
4,3330080762,1504554410899,2094,9,1,2,1,1,1,1,...,3,0,0,1,0,86,11,201,122,18

In [3]:
# Question 3 : 데이터의 행과 열의 갯수를 파악하라.
row, col = df.shape
print(row, col)

51490 61

In [4]:
# Question 4 : 전체 컬럼을 출력하라
print(df.columns)

Index(['gameId', 'creationTime', 'gameDuration', 'seasonId', 'winner',
       'firstBlood', 'firstTower', 'firstInhibitor', 'firstBaron',
       'firstDragon', 'firstRiftHerald', 't1_champ1id', 't1_champ1_sum1',
       't1_champ1_sum2', 't1_champ2id', 't1_champ2_sum1', 't1_champ2_sum2',
       't1_champ3id', 't1_champ3_sum1', 't1_champ3_sum2', 't1_champ4id',
       't1_champ4_sum1', 't1_champ4_sum2', 't1_champ5id', 't1_champ5_sum1',
       't1_champ5_sum2', 't1_towerKills', 't1_inhibitorKills', 't1_baronKills',
       't1_dragonKills', 't1_riftHeraldKills', 't1_ban1', 't1_ban2', 't1_ban3',
       't1_ban4', 't1_ban5', 't2_champ1id', 't2_champ1_sum1', 't2_champ1_sum2',
       't2_champ2id', 't2_champ2_sum1', 't2_champ2_sum2', 't2_champ3id',
       't2_champ3_sum1', 't2_champ3_sum2', 't2_champ4id', 't2_champ4_sum1',
       't2_champ4_sum2', 't2_champ5id', 't2_champ5_sum1', 't2_champ5_sum2',
       't2_towerKills', 't2_inhibitorKills', 't2_baronKills', 't2_dragonKills',
       't2_riftHeraldKills', 't2_ban1', 't2_ban2', 't2_ban3', 't2_ban4',
       't2_ban5'],
      dtype='object')

In [5]:
# Question 5 : 6번째 컬럼명을 출력하라.
print(df.columns[5])

firstBlood

In [6]:
# Question 6 : 6번째 컬럼의 데이터 타입을 확인하라.
print(df.dtypes[5])

int64

In [7]:
# Question 7 : 데이터셋의 인덱스 구성은 어떠한가.
print(df.index)

RangeIndex(start=0, stop=51490, step=1)

In [8]:
# Question 8 : 6번째 컬럼의 3번째 값은 무엇인가.
print(df.iloc[2, 5])

2

In [9]:
# Question 9 : 데이터를 로드하라. 컬럼이 한글이기 때문에 적절하게 처리해야함.
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/Jeju.csv', encoding='euc-kr')

In [10]:
# Question 10 : 데이터 마지막 3개 행을 출력하라.
df.tail(3)

,id,일자,시도명,읍면동명,거주인구,근무인구,방문인구,총 유동인구,평균 속도,평균 소요 시간,평균 기온,일강수량,평균 풍속
9618,32066,2020-04-30,제주시,도두동,28397.481,3144.895,84052.697,115595.073,41.053,29.421,20.3,0.0,3.0
9619,32067,2020-04-30,서귀포시,안덕면,348037.846,29106.286,251129.660,628273.792,46.595,49.189,17.6,0.0,3.5
9620,32068,2020-04-30,제주시,연동,1010643.372,65673.477,447622.068,1523938.917,40.863,27.765,14.1,0.0,4.8

In [11]:
# Question 11 : 수치형 변수를 가진 컬럼을 출력하라.
num_cols = df.select_dtypes(include = ['int64', 'float64']).columns
print(num_cols)

Index(['id', '거주인구', '근무인구', '방문인구', '총 유동인구', '평균 속도', '평균 소요 시간', '평균 기온',
       '일강수량', '평균 풍속'],
      dtype='object')

In [12]:
 # Question 12 : 범주형 변수를 가진 컬럼을 출력하라.
obj_cols = df.select_dtypes(include = ['object']).columns
print(obj_cols)

Index(['일자', '시도명', '읍면동명'], dtype='object')

In [13]:
 # Question 13 : 각 컬럼의 결측치 숫자를 파악하라.
df.isnull().sum()

id          0
일자          0
시도명         0
읍면동명        0
거주인구        0
근무인구        0
방문인구        0
총 유동인구      0
평균 속도       0
평균 소요 시간    0
평균 기온       0
일강수량        0
평균 풍속       0
dtype: int64

In [14]:
# Question 14 : 각 컬럼의 데이터 수, 데이터 타입을 한번에 확인하라.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9621 entries, 0 to 9620
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        9621 non-null   int64
 1   일자        9621 non-null   object
 2   시도명       9621 non-null   object
 3   읍면동명      9621 non-null   object
 4   거주인구      9621 non-null   float64
 5   근무인구      9621 non-null   float64
 6   방문인구      9621 non-null   float64
 7   총 유동인구    9621 non-null   float64
 8   평균 속도     9621 non-null   float64
 9   평균 소요 시간  9621 non-null   float64
 10  평균 기온     9621 non-null   float64
 11  일강수량      9621 non-null   float64
 12  평균 풍속     9621 non-null   float64
dtypes: float64(9), int64(1), object(3)
memory usage: 977.3+ KB

In [15]:
# Question 15 : 각 수치형 변수의 분포(사분위, 평균, 표준편차, 최대, 최소)를 확인하라.
df.describe()

,id,거주인구,근무인구,방문인구,총 유동인구,평균 속도,평균 소요 시간,평균 기온,일강수량,평균 풍속
count,9621.000000,9.621000e+03,9621.000000,9621.000000,9.621000e+03,9621.000000,9621.000000,9621.000000,9621.000000,9621.000000
mean,27258.000000,3.174315e+05,35471.201510,195889.561802,5.487922e+05,41.109084,37.215873,13.550828,6.972426,2.753171
std,2777.487804,2.982079e+05,40381.214775,140706.090325,4.608802e+05,8.758631,12.993786,7.745515,27.617260,1.498538
min,22448.000000,9.305552e+03,1407.936000,11538.322000,2.225181e+04,24.333000,12.667000,-9.600000,0.000000,0.000000
25%,24853.000000,9.539939e+04,12074.498000,99632.153000,2.216910e+05,34.250000,27.889000,7.600000,0.000000,1.700000
50%,27258.000000,2.221105e+05,21960.928000,152805.335000,3.866935e+05,39.640000,34.500000,13.400000,0.000000,2.400000
75%,29663.000000,4.106671e+05,40192.032000,236325.109000,6.406918e+05,49.105000,46.176000,19.700000,1.500000,3.400000
max,32068.000000,1.364504e+06,263476.965000,723459.209000,2.066484e+06,103.000000,172.200000,30.400000,587.500000,13.333000

In [16]:
# Question 16 : 거주 인구 컬럼의 값들을 출력하라.
pop_ser = df['거주인구']
pop_ser.head()

0      32249.987
1     213500.997
2    1212382.218
3      33991.653
4     155036.925
Name: 거주인구, dtype: float64

In [17]:
# Question 17 : 평균 속도 컬럼의 4분위 범위(IQR) 값을 구하여라.
Q1 = df['평균 속도'].quantile(0.25)
Q3 = df['평균 속도'].quantile(0.75)
IQR = Q3 - Q1
print(IQR)

14.854999999999997

In [18]:
# Question 18 : 읍면동명 컬럼의 유일값 개수를 출력하라.
nunique = df['읍면동명'].nunique()
print(nunique)

41

# Filtering & Sorting

In [19]:
# Question 20 : 데이터를 로드하라.
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/chipo.csv')
df.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [20]:
# Question 21 : quantitiy 컬럼 값이 3인 데이터를 추출하여 첫 5행을 출력하라.
df_q21 = df[df['quantity'] == 3]
df_q21.head()

,order_id,quantity,item_name,choice_description,item_price
409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$32.94
445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20
689,284,3,Canned Soft Drink,[Diet Coke],$3.75
818,338,3,Bottled Water,NaN,$3.27
850,350,3,Canned Soft Drink,[Sprite],$3.75

In [21]:
# Question 23 : quanitity, item_price 두개의 컬럼으로 구성된 새로운 데이터 프레임을 정의하라.
df_q23 = df[['quantity', 'item_price']]
df_q23.head(2)

   quantity item_price
0         1     $2.39
1         1     $3.39

In [22]:
# Question 24 : item_price 컬럼의 달러표시 문자를 제거하고 float 타입으로 저장하여 new_price 컬럼에 저장하라.
df['new_price'] = df['item_price'].str.strip('$').astype('float64')
df['new_price'].head(3)

0    2.39
1    3.39
2    3.39
Name: new_price, dtype: float64

In [23]:
# Question 25 : new_price 컬럼이 5 이하의 값을 가지는 데이터 프레임을 추출하고, 전체 갯수를 구하여라.
df_q25 = df[df['new_price'] <= 5]
print(len(df_q25))

1652

In [24]:
#  Question 26 : item_name명이 Chicken Salad Bowl 인 데이터 프레임을 추출하고, index 값을 초기화하여라.
df_q26 = df[df['item_name'] == 'Chicken Salad Bowl'].reset_index(drop = True)
df_q26.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
0,20,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75
1,60,2,Chicken Salad Bowl,"[Tomatillo Green Chili Salsa, [Sour Cream, Che...",$22.50,22.50
2,94,2,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$22.50,22.50

In [25]:
 # Question 27 : new_price 값이 9 이하이고 item_name 값이 Chicken Salad Bowl 인 데이터 프레임을 추출하라.
df_q27 = df[(df['new_price'] <= 9) & (df['item_name'] == 'Chicken Salad Bowl')]
df_q27.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
44,20,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75
256,111,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$8.75,8.75
526,220,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Black Beans, Sour ...",$8.75,8.75

In [26]:
# Question 28 : df의 new_price 컬럼 값에 따라 오름차순으로 정렬하고 index를 초기화 하여라.
df_q28 = df.sort_values('new_price').reset_index(drop = True)
df_q28.head(3)

   order_id  quantity      item_name choice_description item_price  new_price
0       471         1  Bottled Water                NaN     $1.09        1.09
1       338         1    Canned Soda        [Coca Cola]     $1.09        1.09
2      1575         1    Canned Soda       [Dr. Pepper]     $1.09        1.09

In [27]:
# Question 29 : df의 item_name 컬럼 값 중 Chips 포함하는 경우의 데이터를 출력하라.
df_q28 = df[df['item_name'].str.contains('Chips')]
df_q28.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
6,3,1,Side of Chips,NaN,$1.69,1.69

In [28]:
# Question 30 : df의 짝수번째 컬람만을 포함하는 데이터 프레임을 출력하라.
df_q30 = df.iloc[:, ::2]
df_q30.head(3)

   order_id                     item_name item_price
0         1  Chips and Fresh Tomato Salsa     $2.39
1         1                          Izze     $3.39
2         1              Nantucket Nectar     $3.39

In [29]:
# Question 31 : df의 new_price 컬럼 값에 따라 내림차순으로 정리하고 index를 초기화하여라.
df_q31 = df.sort_values('new_price', ascending = False).reset_index(drop = True)
df_q31.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
0,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25,44.25
1,1398,3,Carnitas Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$35.25,35.25
2,511,4,Chicken Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$35.00,35.00

In [30]:
# Question 32 : df의 item_name 컬럼값이 Steak Salad 또는 Bowl인 데이터를 인덱싱하라.
df_q32 = df[df['item_name'].isin(['Steak Salad', 'Bowl'])]
df_q32.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20,22.20
664,276,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99
673,279,1,Bowl,"[Adobo-Marinated and Grilled Steak, [Sour Crea...",$7.40,7.40

In [31]:
# Question 33 : df의 item_name 컬럼 값이 Steak Salad 또는 Bowl인 데이터를 데이터 프레임 한 후,
# item_name을 기준으로 중복행이 있으면 제거하되 첫번째 케이스만 남겨라.
df_q31 = df[df['item_name'].isin(['Steak Salad', 'Bowl'])].drop_duplicates('item_name')
df_q31.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20,22.20
664,276,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99

In [32]:
# Question 34 : df의 item_name 컬럼값이 Steak Sald 또는 Bowl인 데이터를 데이터 프레임화 한 후,
# item_name을 기준으로 중복 행이 있으면 제거하되, 마지막 케이스만 남겨라
df_q32 = df[df['item_name'].isin(['Steak Salad', 'Bowl'])].drop_duplicates('item_name', keep = 'last')
df_q32.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
673,279,1,Bowl,"[Adobo-Marinated and Grilled Steak, [Sour Crea...",$7.40,7.40
3502,1406,1,Steak Salad,"[[Lettuce, Fajita Veggies]]",$8.69,8.69

In [33]:
# Question 35 : df의 데이터 중 new_price 값이 new_price 값의 평균값 이상을 가지는 데이터들을 인덱싱하라.
mean_price = df['new_price'].mean()
df_q35 = df[df['new_price'] >= mean_price]
df_q35.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98,10.98
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75,11.75

In [34]:
# Question 36 : df의 데이터 중 item_name의 값이 lzze 데이터를 Fizzy Lizzy로 수정하라.
df['item_name'].replace({'Izze' : 'Fizzy Lizzy'}, inplace = True)
df['item_name'].head(3)

0    Chips and Fresh Tomato Salsa
1                     Fizzy Lizzy
2                Nantucket Nectar
Name: item_name, dtype: object

In [35]:
# Question 37 : df 데이터 중 choice_description 값이 NaN인 데이터의 갯수를 구하여라.
print(df['choice_description'].isnull().sum())

1246

In [36]:
# Question 38 : df 데이터 중 choice_description 값이 NaN인 데이터를 NoData 값으로 대체하라.(loc 이용)
df.loc[df['choice_description'].isnull(), 'choice_description'] = 'NoData'
print(df['choice_description'].isnull().sum())

0

In [37]:
# Question 39 : df의 데이터 중 choice_description 값에 Black이 들어가는 경우를 인덱싱하라.
df_q39 = df[df['choice_description'].str.contains('Black')]
df_q39.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75,11.75
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25,9.25

In [38]:
# Question 40 : df의 데이터 중 choice_decription 값에 Vegetables 들어가지 않는 경우의 갯수를 출력하라.
df_q40 = df[~df['choice_description'].str.contains('Vegetables')]
df_q40.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
0,1,1,Chips and Fresh Tomato Salsa,NoData,$2.39,2.39
1,1,1,Fizzy Lizzy,[Clementine],$3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39

In [39]:
# Question 41 : df의 데이터 중 item_name 값이 N으로 시작하는 데이터를 모두 출력하라.
df_q41 = df[df['item_name'].str.startswith('N')]
df_q41.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
22,11,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
105,46,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39

In [40]:
# Question 42 : df의 데이터 중 item_name 값의 단어갯수가 15개 이상인 데이터를 인덱싱하라.
df_q42 = df[df['item_name'].str.len() >= 15]
df_q42.head(3)

,order_id,quantity,item_name,choice_description,item_price,new_price
0,1,1,Chips and Fresh Tomato Salsa,NoData,$2.39,2.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NoData,$2.39,2.39

In [41]:
# Question 43 : df의 데이터 중 new_price 값이 lst에 해당하는 겨웅의 데이터 프레임을 구하고 그 갯수를 출력하라
lst = [1.69, 2.39, 3.39, 4.45, 9.25, 10.98, 11.75, 16.98]
df_q43 = df[df['new_price'].isin(lst)]
print(len(df_q43))

1393

# Grouping

In [42]:
# Question 44 : 데이터를 로드하고 상위 5개 컬럼을 출력하라.
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/AB_NYC_2019.csv')
df.head(5)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [43]:
# Question 45 : 데이터의 각 host_name의 빈도수를 구하고 host_name으로 정렬하여 상위 5개를 출력하라.
grp_q45 = df.groupby('host_name', as_index = False).size().sort_values('size', ascending = False).head(5).reset_index(drop = True)
grp_q45

      host_name  size
0       Michael   417
1         David   403
2  Sonder (NYC)   327
3          John   294
4          Alex   279

In [44]:
# Question 46 : 데이터의 각 host_name의 빈도수를 구하고 빈도수 기준 내림차순 정렬한 데이터 프레임을 만들어라. 빈도수 컬럼은 counts로 명명한다.
grp_q46 = df.groupby('host_name', as_index = False).size().sort_values('size', ascending = False).reset_index(drop =
True).rename(columns = {'size' : 'counts'})
grp_q46.head(3)

      host_name  counts
0       Michael     417
1         David     403
2  Sonder (NYC)     327

In [45]:
# Question 47 : neighbourhood_group의 값에 따른 neighbourhodd 컬럼 값의 갯수를 구하여라.
grp_q47 = df.groupby(['neighbourhood_group', 'neighbourhood'], as_index = False).size()
grp_q47.head(3)

  neighbourhood_group neighbourhood  size
0               Bronx      Allerton    42
1               Bronx    Baychester     7
2               Bronx       Belmont    24

In [46]:
# Question 48 : neighbourhood_group의 값에 따른 neighbourhood 컬럼 값 중 neighbourhood_group 그룹의 최댓값을 출력하라.
grp_q48 = df.groupby(['neighbourhood_group', 'neighbourhood'], as_index = False).size().groupby('neighbourhood_group', as_index = False).max()
grp_q48.head(3)

  neighbourhood_group    neighbourhood  size
0               Bronx         Woodlawn    70
1            Brooklyn  Windsor Terrace  3920
2           Manhattan     West Village  2658

In [47]:
# Question 49 : neighbourhood_group 값에 따른 price값의 평균, 분산, 최대, 최소 값을 구하여라.
grp_q49 = df[['neighbourhood_group', 'price']].groupby('neighbourhood_group', as_index = False).agg(['mean', 'var',
                                                                                                     'max', 'min'])
grp_q49.head(3)

                          price
                           mean           var    max min
neighbourhood_group
Bronx                 87.496792  11386.885081   2500   0
Brooklyn             124.383207  34921.719135  10000   0
Manhattan            196.875814  84904.159185  10000   0

In [48]:
# Question 50 : neighbourhood_group 값에 따른 review_per_month 평균, 분산, 최대, 최소값을 구하여라.
grp_q50 = df[['neighbourhood_group', 'reviews_per_month']].groupby('neighbourhood_group', as_index = False).agg(['mean', 'var', 'max', 'min'])
grp_q50.head(3)

                    reviews_per_month
                                 mean       var    max   min
neighbourhood_group
Bronx                        1.837831  2.799878  10.34  0.02
Brooklyn                     1.283212  2.299040  14.00  0.01
Manhattan                    1.272131  2.651206  58.50  0.01

In [49]:
# Question 51 : neighbourhood값과 neighbourhood_group 값에 따른 price의 평균을 구하라.
grp_q51 = df[['neighbourhood', 'neighbourhood_group', 'price']].groupby(['neighbourhood', 'neighbourhood_group'], as_index = False).mean()
grp_q51.head(3)

   neighbourhood neighbourhood_group       price
0       Allerton               Bronx   87.595238
1  Arden Heights       Staten Island   67.250000
2       Arrochar       Staten Island  115.000000

In [50]:
# Question 52 : nieghbourhood 값과 neighbourhood_group 값에 따른 price의 평균을 계층적으로 indexing 없이 구하라
grp_q52 = df[['neighbourhood', 'neighbourhood_group', 'price']].groupby(['neighbourhood', 'neighbourhood_group']).mean().unstack()
grp_q52.head()

                         price
neighbourhood_group      Bronx Brooklyn Manhattan      Queens Staten Island
neighbourhood
Allerton             87.595238      NaN       NaN         NaN           NaN
Arden Heights              NaN      NaN       NaN         NaN         67.25
Arrochar                   NaN      NaN       NaN         NaN        115.00
Arverne                    NaN      NaN       NaN  171.779221           NaN
Astoria                    NaN      NaN       NaN  117.187778           NaN

In [51]:
# Question 53 : nieghbourhood값과 neighbourhood_group값에 따른 price의 평균을 계층적 indexing없이 구하고 nan값은 -999값으로 채워라.
grp_q53 = df[['neighbourhood', 'neighbourhood_group', 'price']].groupby(['neighbourhood', 'neighbourhood_group']).mean().unstack().fillna(-999)
grp_q53.head()

                          price
neighbourhood_group       Bronx Brooklyn Manhattan      Queens Staten Island
neighbourhood
Allerton              87.595238   -999.0    -999.0 -999.000000       -999.00
Arden Heights       -999.000000   -999.0    -999.0 -999.000000         67.25
Arrochar            -999.000000   -999.0    -999.0 -999.000000        115.00
Arverne             -999.000000   -999.0    -999.0  171.779221       -999.00
Astoria             -999.000000   -999.0    -999.0  117.187778       -999.00

In [52]:
# Question 54 : 데이터 중 neighbourhood_group 값이 Queens값을 가지는 데이터들 중 neighbourhood 그룹별로 price값의 평균, 분산, 최대, 최솟값을 구하여라.
grp_q54 = df[df['neighbourhood_group'] == 'Queens'].groupby(['neighbourhood'])['price'].agg(['mean', 'var', 'max', 'min'])
grp_q54.head()

                     mean            var    max  min
neighbourhood
Arverne        171.779221   37383.411141   1500   35
Astoria        117.187778  122428.811196  10000   25
Bay Terrace    142.000000    6816.400000    258   32
Bayside        157.948718  166106.470985   2600   30
Bayswater       87.470588    2330.889706    230   45

In [53]:
# Question 55 : 데이터 중 neighbourhood_group 값에 따른 room_type 컬럼의 숫자를 구하고 neighbourhood_group 값을 기준으로 각 값의 비율을 구하여라.
grp_q55 = df[['neighbourhood_group', 'room_type']].groupby(['neighbourhood_group', 'room_type']).size().unstack()
grp_q55.loc[:,:] = grp_q55.values / grp_q55.sum(axis = 1).values.reshape(-1, 1)
grp_q55

room_type            Entire home/apt  Private room  Shared room
neighbourhood_group
Bronx                       0.347388      0.597617     0.054995
Brooklyn                    0.475478      0.503979     0.020543
Manhattan                   0.609344      0.368496     0.022160
Queens                      0.369926      0.595129     0.034945
Staten Island               0.471850      0.504021     0.024129

# Apply, Map

In [54]:
 # Question 56 : 데이터를 로드하고 데이터 행과 열의 갯수를 출력하라.
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv', index_col = 0)
print(df.shape)

(10127, 18)

In [55]:
 # Qustion 57 : Income_Category의 카테고리를 map함수를 이용하여 다음과 같이 변경하여 newIncome컬럼에 매핑하라.
dic = {
 'Unknown' : 'N',
 'Less than $40K' : 'a',
 '$40K - $60K' : 'b',
 '$60K - $80K' : 'c',
 '$80K - $120K' : 'd',
 '$120K +' : 'e'
}
df['newIncome'] = df['Income_Category'].map(lambda x: dic[x])
df['newIncome'].head(3)

0    c
1    a
2    d
Name: newIncome, dtype: object

In [56]:
# Question 58 : Income_Category의 카테고리를 apply 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑하라.
def changeCategory(x) :
    if x == "Unkown" :
         return 'N'
    elif x == "Less than $40K" :
         return "a"
    elif x == "$40K - $60K" :
         return "b"
    elif x == "$60K - $80K" :
         return "c"
    elif x == "$80K - $120K" :
         return "d"
    elif x == "$120K +" :
         return "e"
        
df.newIncome = df.Income_Category.apply(changeCategory)
df.newIncome.head()

0    c
1    a
2    d
3    a
4    c
Name: newIncome, dtype: object

In [57]:
# Question 59 : Customer_Age의 값을 이용하여 나이 구간을 AgeState 컬럼으로 정의하라.(0~9 : 0, 10~19 : 10, 20~29 : 20, ...) 각 구간의 빈도수를 출력하라.
df['AgeState'] = df['Customer_Age'].map(lambda x: x // 10 * 10)
df['AgeState'].value_counts()

40    4561
50    2998
30    1841
60     530
20     195
70       2
Name: AgeState, dtype: int64

In [58]:
# Question 60 : Education_Level의 값 중 Graduate 단어가 포함되는 값은 1 그렇지 않은 경우에는 0으로 변경하여 newEduLevel 컬럼을 정의하고 빈도수를 출력하라.
df['newEduLevel'] = df['Education_Level'].map(lambda x: 1 if 'Graduate' in x else 0)
df['newEduLevel'].value_counts()

0    6483
1    3644
Name: newEduLevel, dtype: int64

In [59]:
# Question 61 : Credit_Limit 컬럼값이 4500 이상인 경우 1 그외의 경우에는 모두 0으로 하는 newLimit 정의하라.
df['newLimit'] = df['Credit_Limit'].map(lambda x: 1 if x >= 4500 else 0)
df['newLimit'].value_counts()

1    5096
0    5031
Name: newLimit, dtype: int64

In [60]:
# Question 62 : Marital_Status 컬럼값이 Married 이고 Card_Category 컬럼값이 Platinum인 경우 1 그외의 경우에는 모두 0으로 하는 newState 컬럼을 정의하라.
df['newState'] = df.apply(lambda x: 1 if (x['Marital_Status'] == 'Married') & (x['Card_Category'] == 'Platinum') else 0, axis = 1)
df['newState'].value_counts()

0    10120
1        7
Name: newState, dtype: int64

In [61]:
# Question 63 : Gender 컬럼값이 M인 경우 male F인 경우 female로 값을 변경하여 Gender 컬럼에 새롭게 정의하라. 각 value의 빈도를 출력하라.
def changeGender(row) :
    if row['Gender'] == 'M' :
        return 'male'
    else :
        return 'female'

df['Gender'] = df.apply(changeGender, axis = 1)
df['Gender'].value_counts()

female    5358
male      4769
Name: Gender, dtype: int64

# Time Series

In [62]:
# Question 64 : 데이터를 로드하고 각 열의 데이터 타입을 파악하라.
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/timeTest.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6574 entries, 0 to 6573
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Yr_Mo_Dy  6574 non-null   object
 1   RPT       6568 non-null   float64
 2   VAL       6571 non-null   float64
 3   ROS       6572 non-null   float64
 4   KIL       6569 non-null   float64
 5   SHA       6572 non-null   float64
 6   BIR       6574 non-null   float64
 7   DUB       6571 non-null   float64
 8   CLA       6572 non-null   float64
 9   MUL       6571 non-null   float64
 10  CLO       6573 non-null   float64
 11  BEL       6574 non-null   float64
 12  MAL       6570 non-null   float64
dtypes: float64(12), object(1)
memory usage: 667.8+ KB

In [63]:
# Question 65 : Yr_Mo_Dy을 판다스에서 인식할 수 있는 datetime64 타입으로 변경하라.
df['Yr_Mo_Dy'] = pd.to_datetime(df['Yr_Mo_Dy'])
df['Yr_Mo_Dy'].head(3)

0   2061-01-01
1   2061-01-02
2   2061-01-03
Name: Yr_Mo_Dy, dtype: datetime64[ns]

In [64]:
# Question 66 : Yr_Mo_Dy에 존재하는 년도의 유일값을 모두 출력하라.
df.Yr_Mo_Dy.dt.year.unique()

array([2061, 2062, 2063, 2064, 2065, 2066, 2067, 2068, 2069, 2070, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978])

In [66]:
# Question 67 : Yr_Mo_Dy에 년도가 2061년 이상의 경우에는 모두 잘못된 데이터이다. 해당 경우의 값은 100을 빼서 새롭게 날짜를 Yr_Mo_ Dy 컬럼에 정의하라.
def fix_year(x) :
    import datetime
    year = x.year - 100 if x.year > 2980 else x.year
    return pd.to_datetime(datetime.date(year, x.month, x.day))

df['Yr_Mo_Dy'] = df['Yr_Mo_Dy'].apply(fix_year)

In [67]:
# Question 68 : 년도별 각 컬럼의 평균값을 구하여라.
grp_q68 = df.groupby(df['Yr_Mo_Dy'].dt.year).mean()
grp_q68.head()

,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL
Yr_Mo_Dy,,,,,,,,,,,,
1971,11.273123,9.095178,11.088329,5.241507,9.440329,6.097151,8.385890,6.757315,7.915370,7.229753,12.208932,15.025233
1972,12.463962,10.561311,12.058333,5.929699,9.430410,6.358825,9.704508,7.680792,8.357295,7.515273,12.727377,15.028716
1973,11.828466,10.680493,10.680493,5.547863,9.640877,6.548740,8.482110,7.614274,8.245534,7.812411,12.169699,15.441096
1974,13.643096,11.811781,12.336356,6.427041,11.110986,6.809781,10.084603,9.896986,9.331753,8.736356,13.252959,16.947671
1975,12.008575,10.293836,11.564712,5.269096,9.190082,5.668521,8.562603,7.843836,8.797945,7.382822,12.631671,15.307863

In [68]:
# Question 69 : weekday 컬럼을 만들고 요일별로 매핑하라.
df['weekday'] = df['Yr_Mo_Dy'].dt.weekday
df['weekday'].head(3)

0    5
1    6
2    0
Name: weekday, dtype: int64

In [69]:
# Question 70 : weekday 컬럼을 기준으로 주말이면 1 평일이면 0의 값을 가지는 WeekCheck 컬럼을 만들어라.
df['WeekCheck'] = df['weekday'].map(lambda x: 1 if x in [5, 6] else 0)
df['WeekCheck'].head(3)

0    1
1    1
2    0
Name: WeekCheck, dtype: int64

In [70]:
# Question 71 : 년도, 일자 상관없이 모든 컬럼의 각 달 평균을 구하여라.
grp_q71 = df.groupby(df['Yr_Mo_Dy'].dt.month).mean()
grp_q71.head(3)

,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL,weekday,WeekCheck
Yr_Mo_Dy,,,,,,,,,,,,,,
1,14.847325,12.914560,13.299624,7.199498,11.667734,8.054839,11.819355,9.512047,9.543208,10.053566,14.550520,18.028763,2.998208,0.288530
2,13.710906,12.111122,12.879132,6.942411,11.551772,7.633858,11.206024,9.341437,9.313169,9.518051,13.728898,17.156142,3.001969,0.285433
3,13.158687,11.505842,12.648118,7.265907,11.554516,7.959409,11.310179,9.635896,9.700324,10.096953,13.810609,16.909317,2.996416,0.283154

In [71]:
# Question 72 : 모든 결측치는 컬럼기준 직전의 값으로 대체하고 첫번재 행에 결측치가 있을 경우 뒤에 있는 값으로 대체하라.
df = df.fillna(method = 'ffill').fillna(method = 'bfill')
df.isnull().sum()

Yr_Mo_Dy     0
RPT          0
VAL          0
ROS          0
KIL          0
SHA          0
BIR          0
DUB          0
CLA          0
MUL          0
CLO          0
BEL          0
MAL          0
weekday      0
WeekCheck    0
dtype: int64

In [72]:
# Question 73 : 년도 - 월을 기준으로 모든 컬럼의 평균값을 구하여라.
grouped_q73 = df.groupby(df.Yr_Mo_Dy.dt.to_period('M')).mean()
grouped_q73.head()

,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL,weekday,WeekCheck
Yr_Mo_Dy,,,,,,,,,,,,,,
1971-01,15.098065,13.398387,13.080000,6.364194,11.342258,7.759677,10.297419,8.350000,8.979355,8.666774,14.392581,16.360000,3.193548,0.322581
1971-02,11.724643,9.757143,10.311786,5.242143,9.676786,5.492143,8.683929,7.075000,8.272857,7.833571,12.883929,15.863214,3.000000,0.285714
1971-03,10.844839,8.243226,11.228387,5.629032,8.960000,5.486774,9.061935,6.700000,8.494516,7.758387,11.510000,15.678387,2.806452,0.258065
1971-04,9.884333,6.848000,11.187667,4.891333,8.165000,5.319000,6.688000,5.856667,7.512667,6.051333,9.014000,12.301000,3.033333,0.266667
1971-05,11.200645,8.883548,9.564839,4.888387,8.322903,5.423226,5.875806,7.230323,7.494839,7.122581,11.926129,13.107742,3.064516,0.322581

In [73]:
# Question 74 : RPT 컬럼의 값을 일자별 기준으로 1차 차분하라.
res_q74 = df['RPT'].diff()
res_q74.head()

0     NaN
1   -0.33
2    3.79
3   -7.92
4    2.75
Name: RPT, dtype: float64

In [74]:
# Question 75 : RPT와 VAL의 컬럼을 일주일 간격으로 각각 이동평균한값을 구하여라.
res_q75 = df[['RPT', 'VAL']].rolling(7).mean()
res_q75[5:10]

         RPT        VAL
5        NaN        NaN
6  14.124286  12.727143
7  13.541429  11.982857
8  13.237143  11.392857
9  12.504286  10.570000

In [75]:
# Question 76 : 년-월-일:시 컬럼을 pandas에서 인식할 수 있는 datetime 형태로 변경하라. 서울시의 제공데이터의 경우 0 시가 24시로 표현된다.
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/seoul_pm.csv')
df.head()

,(년-월-일:시),PM10등급,PM10,PM2.5등급,PM2.5,오존등급,오존,이산화질소등급,이산화질소,일산화탄소등급,일산화탄소,아황산가스등급,아황산가스
0,2021-05-15:15,보통,47.0,보통,19.0,좋음,0.017,좋음,0.023,좋음,0.4,좋음,0.003
1,2021-05-15:14,보통,43.0,보통,20.0,좋음,0.024,좋음,0.019,좋음,0.3,좋음,0.003
2,2021-05-15:13,보통,34.0,보통,24.0,보통,0.035,좋음,0.017,좋음,0.4,좋음,0.004
3,2021-05-15:12,보통,41.0,보통,27.0,보통,0.037,좋음,0.020,좋음,0.4,좋음,0.004
4,2021-05-15:11,보통,51.0,보통,34.0,보통,0.033,좋음,0.023,좋음,0.4,좋음,0.005

In [76]:
 def change_date(x) :
    import datetime
    hour = x.split(':')[1]
    date = x.split(':')[0]

    if hour == '24':
        hour = '00:00:00'
        return pd.to_datetime(date + " " + hour) + datetime.timedelta(days = 1)
    else :
        hour += ':00:00'
        return pd.to_datetime(date + " " + hour)

df['(년-월-일:시)'] = df['(년-월-일:시)'].apply(change_date)
df.head()

,(년-월-일:시),PM10등급,PM10,PM2.5등급,PM2.5,오존등급,오존,이산화질소등급,이산화질소,일산화탄소등급,일산화탄소,아황산가스등급,아황산가스
0,2021-05-15 15:00:00,보통,47.0,보통,19.0,좋음,0.017,좋음,0.023,좋음,0.4,좋음,0.003
1,2021-05-15 14:00:00,보통,43.0,보통,20.0,좋음,0.024,좋음,0.019,좋음,0.3,좋음,0.003
2,2021-05-15 13:00:00,보통,34.0,보통,24.0,보통,0.035,좋음,0.017,좋음,0.4,좋음,0.004
3,2021-05-15 12:00:00,보통,41.0,보통,27.0,보통,0.037,좋음,0.020,좋음,0.4,좋음,0.004
4,2021-05-15 11:00:00,보통,51.0,보통,34.0,보통,0.033,좋음,0.023,좋음,0.4,좋음,0.005

In [77]:
# Question 77 : 일자별 영어요일 이름을 dayName 컬럼에 저장하라.
df['dayName'] = df['(년-월-일:시)'].dt.day_name()
df['dayName'].head(3)

0    Saturday
1    Saturday
2    Saturday
Name: dayName, dtype: object

In [78]:
# Question 78 : 일자별 각 PM10 등급의 빈도수를 파악하라.
grp_q78 = df[['dayName', 'PM10']].groupby(['dayName', 'PM10'], as_index = False).size()
grp_q78.head()

  dayName  PM10  size
0  Friday  11.0     1
1  Friday  12.0     5
2  Friday  17.0     2
3  Friday  19.0     2
4  Friday  24.0     1

In [79]:
# Question 79 : 시간이 연속적으로 존재하며 결측치가 없는지 확인하라.
check = len(df['(년-월-일:시)'].diff().unique())
if check == 2 :
    print("True")
else :
    print("False")

True

In [80]:
# Question 80 : 오전 10시와 오후 10시의 PM10의 평균값을 각각 구하여라.
grp_q80 = df[['(년-월-일:시)', 'PM10']].groupby(df['(년-월-일:시)'].dt.hour, as_index = False).mean().iloc[[10, 20], :]
grp_q80

         PM10
10  70.384615
20  67.666667

In [81]:
# Question 81 : 날짜 컬럼을 index로 만들어라.
df.set_index(['(년-월-일:시)'], inplace = True)
df.head(3)

,PM10등급,PM10,PM2.5등급,PM2.5,오존등급,오존,이산화질소등급,이산화질소,일산화탄소등급,일산화탄소,아황산가스등급,아황산가스,dayName
(년-월-일:시),,,,,,,,,,,,,
2021-05-15 15:00:00,보통,47.0,보통,19.0,좋음,0.017,좋음,0.023,좋음,0.4,좋음,0.003,Saturday
2021-05-15 14:00:00,보통,43.0,보통,20.0,좋음,0.024,좋음,0.019,좋음,0.3,좋음,0.003,Saturday
2021-05-15 13:00:00,보통,34.0,보통,24.0,보통,0.035,좋음,0.017,좋음,0.4,좋음,0.004,Saturday

In [82]:
# Question 82 : 데이터를 주 단위로 뽑아서 최소, 최대, 평균, 표준편차를 구하여라.
grouped_q82 = df.resample('W').agg(['min', 'max', 'mean', 'std'])
grouped_q82.head()

/tmp/ipykernel_10548/1305192967.py:2: FutureWarning: ['PM10등급', 'PM2.5등급', '오존등급', '이산화질소등급', '일산화탄소등급', '아황산가스등급', 'dayName'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped_q82 = df.resample('W').agg(['min', 'max', 'mean', 'std'])

            PM10                               PM2.5                    \
             min    max       mean         std   min    max       mean
(년-월-일:시)
2021-03-28   6.0  160.0  72.747368   43.345462   4.0  113.0  44.705263
2021-04-04   3.0  598.0  97.148810  129.911976   1.0  120.0  23.168675
2021-04-11  17.0  102.0  41.059524   16.325911   7.0   70.0  21.761905
2021-04-18   3.0  367.0  48.180723   43.254468   2.0   38.0  17.066265
2021-04-25  17.0  126.0  55.119048   26.659936   7.0   61.0  26.392857

                          오존         ...     이산화질소           일산화탄소       \
                  std    min    max  ...      mean       std   min  max
(년-월-일:시)                            ...
2021-03-28  29.551928  0.002  0.085  ...  0.044579  0.023722   0.3  1.4
2021-04-04  22.399578  0.003  0.055  ...  0.027929  0.014978   0.3  0.9
2021-04-11  11.479343  0.009  0.070  ...  0.022583  0.009562   0.3  0.7
2021-04-18   7.867952  0.002  0.070  ...  0.023753  0.013553   0.3  0.6
2021-04-25  13.094788  0.006  0.090  ...  0.028571  0.014640   0.3  0.8

                                아황산가스
                mean       std    min    max      mean       std
(년-월-일:시)
2021-03-28  0.611579  0.232408  0.002  0.006  0.003274  0.000961
2021-04-04  0.445833  0.135741  0.002  0.004  0.002732  0.000541
2021-04-11  0.389286  0.087573  0.002  0.004  0.002744  0.000569
2021-04-18  0.386747  0.084954  0.002  0.004  0.002464  0.000579
2021-04-25  0.457143  0.122142  0.001  0.011  0.003631  0.001763

[5 rows x 24 columns]

# Pivot

In [83]:
# Question 83 : Indicator을 삭제하고 First Tooltip 컬럼에서 신뢰구간에 해당하는 표현을 지워라.
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/under5MortalityRate.csv')
df.head()

,Location,Period,Indicator,Dim1,First Tooltip
0,Afghanistan,2019,Under-five mortality rate (probability of dyin...,Both sexes,60.27 [47.44-74.62]
1,Afghanistan,2019,Under-five mortality rate (probability of dyin...,Male,63.83 [50.04-79.16]
2,Afghanistan,2019,Under-five mortality rate (probability of dyin...,Female,56.57 [44.54-70.18]
3,Afghanistan,2018,Under-five mortality rate (probability of dyin...,Both sexes,62.54 [50.64-75.41]
4,Afghanistan,2018,Under-five mortality rate (probability of dyin...,Male,66.08 [53.41-79.76]

In [84]:
df.drop(['Indicator'], axis = 1, inplace = True)
df['First Tooltip'] = df['First Tooltip'].map(lambda x: float(x.split(" ")[0]))
df.head()

      Location  Period        Dim1  First Tooltip
0  Afghanistan    2019  Both sexes          60.27
1  Afghanistan    2019        Male          63.83
2  Afghanistan    2019      Female          56.57
3  Afghanistan    2018  Both sexes          62.54
4  Afghanistan    2018        Male          66.08

In [85]:
# Question 84 : 년도가 2015년 이상, DIm1이 Both sexes인 케이스만 추출하라.
df_q84 = df[(df['Period'] >= 2015) & (df['Dim1'] == 'Both sexes')]
df_q84.head(3)

      Location  Period        Dim1  First Tooltip
0  Afghanistan    2019  Both sexes          60.27
3  Afghanistan    2018  Both sexes          62.54
6  Afghanistan    2017  Both sexes          64.94

In [88]:
# Question 85 : 84번 문제에서 추출한 데이터로 아래와 같이 나라에 따른 년도별 사망률 데이터 프레임화 하라.
pvt_q85 = df_q84.pivot_table(values = 'First Tooltip', index = 'Location', columns = 'Period')
pvt_q85.head(3)

Period        2015   2016   2017   2018   2019
Location
Afghanistan  70.44  67.57  64.94  62.54  60.27
Albania       9.57   9.42   9.42   9.53   9.68
Algeria      25.18  24.79  24.32  23.81  23.26

In [89]:
# Question 86 : Dim1에 따른 년도별 사망비율의 평균을 구하여라.
pvt_q86 = df.pivot_table(values = 'First Tooltip', index = 'Dim1', columns = 'Period', aggfunc = 'mean')
pvt_q86.head(3)

Period,1950,1951,1952,1953,1954,1955,1956,1957,1958,1959,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
Dim1,,,,,,,,,,,,,,,,,,,,,
Both sexes,147.700816,155.537544,157.811094,156.147206,154.539857,155.797179,159.241163,156.170114,150.813222,150.574000,...,37.718488,35.573663,34.290988,33.099360,32.053314,31.012093,29.956337,29.030465,28.083837,27.191744
Female,140.909796,149.210175,151.516094,150.250882,148.688286,149.843205,153.048721,149.988295,144.719667,144.451474,...,34.953023,32.877616,31.654070,30.521337,29.524302,28.544360,27.542035,26.675291,25.782616,24.945349
Male,154.151224,161.538246,163.760781,161.742059,160.081000,161.456923,165.089535,162.015000,156.573556,156.375053,...,40.340174,38.140291,36.793081,35.543663,34.446105,33.354302,32.242616,31.273198,30.283023,29.350349

In [90]:
# Question 87 : 데이터에서 한국 KOR 데이터만 추출하라.
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/winter.csv')
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1924,Chamonix,Biathlon,Biathlon,"BERTHET, G.",FRA,Men,Military Patrol,Bronze
1,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, C.",FRA,Men,Military Patrol,Bronze
2,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, Maurice",FRA,Men,Military Patrol,Bronze
3,1924,Chamonix,Biathlon,Biathlon,"VANDELLE, André",FRA,Men,Military Patrol,Bronze
4,1924,Chamonix,Biathlon,Biathlon,"AUFDENBLATTEN, Adolf",SUI,Men,Military Patrol,Gold

In [91]:
df_q87 = df[df['Country'] == 'KOR']
df_q87.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
2652,1992,Albertville,Skating,Short Track Speed Skating,"LEE, Jun-Ho",KOR,Men,1000M,Bronze
2653,1992,Albertville,Skating,Short Track Speed Skating,"KIM, Ki-Hoon",KOR,Men,1000M,Gold
2671,1992,Albertville,Skating,Short Track Speed Skating,"KIM, Ki-Hoon",KOR,Men,5000M Relay,Gold
2672,1992,Albertville,Skating,Short Track Speed Skating,"LEE, Jun-Ho",KOR,Men,5000M Relay,Gold
2673,1992,Albertville,Skating,Short Track Speed Skating,"MO, Ji-Soo",KOR,Men,5000M Relay,Gold

In [92]:
# Question 88 : 한국 올림픽 메달리스트 데이터에서 년도에 따른 medal 갯수를 데이터프레임화하라.
pvt_q88 = df_q87.pivot_table(index = 'Year', columns = 'Medal', aggfunc = 'size')
pvt_q88.head(3)

Medal  Bronze  Gold  Silver
Year
1992      1.0   5.0     1.0
1994      1.0   8.0     1.0
1998      2.0   6.0     4.0

In [93]:
# Question 89 : 전체 데이터에서 sport 종류에 따른 성별수를 구하여라.
pvt_q89 = df.pivot_table(index = 'Sport', columns = 'Gender', aggfunc = 'size')
pvt_q89.head(3)

Gender     Men  Women
Sport
Biathlon   270    150
Bobsleigh  416     36
Curling     97     75

In [94]:
# Question 90 : 전체 데이터에서 Discipline 종류에 따른 Medal 수를 구하여라.
pvt_q90 = df.pivot_table(index = 'Discipline', columns = 'Medal', aggfunc = 'size')
pvt_q90.head(3)

Medal          Bronze  Gold  Silver
Discipline
Alpine Skiing     141   143     144
Biathlon          139   140     141
Bobsleigh         147   134     141

# Merge, Concat

In [95]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/mergeTEst.csv',index_col= 0)
df1 = df.iloc[:4,:]
df2 = df.iloc[4:,:]
display(df1)
display(df2)

,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
Location,,,,,,,,,,
Afghanistan,64.023,61.640,59.367,57.170,55.08,53.107,51.267,49.560,47.983,46.453
Albania,11.803,10.807,9.943,9.267,8.79,8.493,8.363,8.363,8.453,8.597
Algeria,23.540,22.907,22.450,22.117,21.85,21.587,21.257,20.850,20.407,19.930
Andorra,4.240,4.033,3.843,3.667,3.49,3.330,3.187,3.060,2.933,2.827

,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
Location,,,,,,,,,,
Angola,75.713,71.280,67.233,63.570,60.430,57.757,55.510,53.460,51.757,50.093
Antigua and Barbuda,8.667,8.223,7.807,7.420,7.070,6.757,6.483,6.230,6.000,5.783
Argentina,12.887,12.380,11.840,11.283,10.733,10.203,9.683,9.177,8.680,8.227
Armenia,16.497,15.677,14.897,14.170,13.477,12.817,12.183,11.583,11.007,10.497
Australia,3.993,3.803,3.623,3.467,3.343,3.253,3.183,3.137,3.090,3.047
Austria,3.573,3.463,3.333,3.210,3.113,3.043,2.987,2.943,2.897,2.843

In [96]:
# Question 91 : df1과 df2데이터를 하나의 데이터프레임으로 합쳐라.
df_q91 = pd.concat([df1, df2])
df_q91.head(3)

,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
Location,,,,,,,,,,
Afghanistan,64.023,61.640,59.367,57.170,55.08,53.107,51.267,49.560,47.983,46.453
Albania,11.803,10.807,9.943,9.267,8.79,8.493,8.363,8.363,8.453,8.597
Algeria,23.540,22.907,22.450,22.117,21.85,21.587,21.257,20.850,20.407,19.930

In [97]:
# Question 92 : df3과 df4 데이터를 하나의 데이터프레임으로 합쳐라. 둘다 포함하고 있는 년도에 대해서만 고려한다.
df3 = df.iloc[:2,:4]
df4 = df.iloc[5:,3:]
display(df3)
display(df4)

               2010    2011    2012    2013
Location
Afghanistan  64.023  61.640  59.367  57.170
Albania      11.803  10.807   9.943   9.267

                       2013    2014    2015    2016    2017    2018    2019
Location
Antigua and Barbuda   7.420   7.070   6.757   6.483   6.230   6.000   5.783
Argentina            11.283  10.733  10.203   9.683   9.177   8.680   8.227
Armenia              14.170  13.477  12.817  12.183  11.583  11.007  10.497
Australia             3.467   3.343   3.253   3.183   3.137   3.090   3.047
Austria               3.210   3.113   3.043   2.987   2.943   2.897   2.843

In [98]:
df_q92 = pd.concat([df3, df2], join = 'inner')
df_q92.head(3)

               2010    2011    2012    2013
Location
Afghanistan  64.023  61.640  59.367  57.170
Albania      11.803  10.807   9.943   9.267
Angola       75.713  71.280  67.233  63.570

In [99]:
# Question 93 : df3과 df4 데이터를 하나의 데이터프레미으로 합쳐라. 모든 컬럼을 포함하고, 결측치는 0으로 대체한다.
df_q93 = pd.concat([df3, df4], join = 'outer').fillna(0)
df_q93.head(3)

,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
Location,,,,,,,,,,
Afghanistan,64.023,61.640,59.367,57.170,0.00,0.000,0.000,0.00,0.0,0.000
Albania,11.803,10.807,9.943,9.267,0.00,0.000,0.000,0.00,0.0,0.000
Antigua and Barbuda,0.000,0.000,0.000,7.420,7.07,6.757,6.483,6.23,6.0,5.783

In [100]:
df5 = df.T.iloc[:7,:3]
df6 = df.T.iloc[6:,2:5]
display(df5)
display(df6)

Location  Afghanistan  Albania  Algeria
2010           64.023   11.803   23.540
2011           61.640   10.807   22.907
2012           59.367    9.943   22.450
2013           57.170    9.267   22.117
2014           55.080    8.790   21.850
2015           53.107    8.493   21.587
2016           51.267    8.363   21.257

Location  Algeria  Andorra  Angola
2016       21.257    3.187  55.510
2017       20.850    3.060  53.460
2018       20.407    2.933  51.757
2019       19.930    2.827  50.093

In [103]:
# Question 94 : df5과 df6 데이터를 하나의 데이터프레임으로 merge함수를 이용하여 합쳐라. Algeria 컬럼을 key로 하고 두 데이터 모두 포함하는 데이터만 출력하라.
df_q94 = df5.merge(df6, on = 'Algeria')
df_q94.head()

Location  Afghanistan  Albania  Algeria  Andorra  Angola
0              51.267    8.363   21.257    3.187   55.51

In [104]:
# Question 95 : df5과 df6 데이터를 하나의 데이터프레임으로 merge 함수를 이용하여 함쳐라. Algeria 컬럼을 key로 하고 합집합으로 합쳐라.
df_q95 = df5.merge(df6, on = 'Algeria', how = 'outer')
df_q95.head()

Location  Afghanistan  Albania  Algeria  Andorra  Angola
0              64.023   11.803   23.540      NaN     NaN
1              61.640   10.807   22.907      NaN     NaN
2              59.367    9.943   22.450      NaN     NaN
3              57.170    9.267   22.117      NaN     NaN
4              55.080    8.790   21.850      NaN     NaN